## Data Manipulation and Analysis with Pandas

Data manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a 
wide range of functions for data manipulation and analysis, making it easier to clean, transfrom, and extract
insights from data. in this lesson, we will cover various data manipulation and analtsis techniques using Pandas.

Pandas data manipulation aur analysis ke liye ek powerful Python library hai jo kisi bhi data science project ka base banati hai. Iski madad se hum raw data ko easily clean, filter, sort, merge, group, aur transform kar sakte hain. Pandas ke DataFrame aur Series jaise structures data ko table-format me organize karte hain, jisse calculations, missing values handle karna, columns add/remove karna, aur alag-alag insights nikalna bahut simple ho jata hai. Real-world projects me jaise sales data analysis, customer behavior study, ya ML model ke liye data preprocessing—sab me Pandas sabse important tool hota hai. Ek line me bolen to: Pandas data ko readable, organized, aur analysis-friendly bana deta hai

In [4]:
import pandas as pd

In [5]:
df= pd.read_csv('sales_data.csv')
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [6]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [7]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [8]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [9]:
## Handking Minssing V alues
df.isnull().any()

Transaction ID      False
Date                False
Product Category    False
Product Name        False
Units Sold          False
Unit Price          False
Total Revenue       False
Region              False
Payment Method      False
dtype: bool

In [10]:
df.isnull().sum()

Transaction ID      0
Date                0
Product Category    0
Product Name        0
Units Sold          0
Unit Price          0
Total Revenue       0
Region              0
Payment Method      0
dtype: int64

In [11]:
df_filled=df.fillna(0)

In [12]:
## Filling missing values with the mean of the column
df['Total Revenue'] = df['Total Revenue'].fillna(df['Total Revenue'].mean())
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [13]:
print(df.columns)

Index(['Transaction ID', 'Date', 'Product Category', 'Product Name',
       'Units Sold', 'Unit Price', 'Total Revenue', 'Region',
       'Payment Method'],
      dtype='object')

In [14]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [15]:
# Renameing Columns
df=df.rename(columns={'Date': 'Sale Date'})
df.head()

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [16]:
## changeing data types
df['Sale Date']= pd.to_datetime(df['Sale Date'])
df.head()

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [18]:
df['Unit Price']=df['Unit Price'].fillna(df['Unit Price'].mean()).astype(int)
df.head()

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89,89.99,Europe,PayPal

In [19]:
df['Unit Price']=df['Unit Price'].apply(lambda x:x*2)
df.head()

,Transaction ID,Sale Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,1998,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,998,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,138,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,30,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,178,89.99,Europe,PayPal

In [20]:
# Data aggregating And Grouping
df_grouped=df.groupby('Product Category')['Total Revenue'].sum().reset_index()
df_grouped

  Product Category  Total Revenue
0  Beauty Products        2621.90
1            Books        1861.93
2         Clothing        8128.93
3      Electronics       34982.41
4  Home Appliances       18646.16
5           Sports       14326.52

In [21]:
grouped_sum=df.groupby(['Product Category', 'Region'])['Total Revenue'].sum()
print(grouped_sum)

Product Category  Region
Beauty Products   Europe            2621.90
Books             North America     1861.93
Clothing          Asia              8128.93
Electronics       North America    34982.41
Home Appliances   Europe           18646.16
Sports            Asia             14326.52
Name: Total Revenue, dtype: float64

In [22]:
grouped_sum=df.groupby(['Product Category', 'Region'])['Total Revenue'].mean()
print(grouped_sum)

Product Category  Region
Beauty Products   Europe            65.54750
Books             North America     46.54825
Clothing          Asia             203.22325
Electronics       North America    874.56025
Home Appliances   Europe           466.15400
Sports            Asia             358.16300
Name: Total Revenue, dtype: float64

In [23]:
## aggreagate multiple functions
grouped_agg=df.groupby(['Product Category', 'Region'])['Total Revenue'].agg(['sum', 'mean', 'max', 'min'])
print(grouped_agg)

                                     sum       mean      max    min
Product Category Region
Beauty Products  Europe          2621.90   65.54750   399.99   6.50
Books            North America   1861.93   46.54825   130.00  17.98
Clothing         Asia            8128.93  203.22325   539.94  39.60
Electronics      North America  34982.41  874.56025  3899.99  99.99
Home Appliances  Europe         18646.16  466.15400  2599.98  89.99
Sports           Asia           14326.52  358.16300  1895.00  59.98

In [39]:
## Merging and Joining DataFrames
df1=pd.DataFrame({
    'Product ID': [1, 2, 3, 4, 5],
    'Product Name': ['A', 'B', 'C', 'D', 'E']
})

df2=pd.DataFrame({
    'Product ID': [1, 2, 3, 5], 
    'Price': [100, 200, 300, 400]
})

In [40]:
df1,df2

(   Product ID Product Name
 0           1            A
 1           2            B
 2           3            C
 3           4            D
 4           5            E,
    Product ID  Price
 0           1    100
 1           2    200
 2           3    300
 3           5    400)

In [41]:
## Merging on the 'Key Column' 
merged_df=pd.merge(df1, df2, on='Product ID', how='inner')
merged_df

   Product ID Product Name  Price
0           1            A    100
1           2            B    200
2           3            C    300
3           5            E    400

In [42]:
pd.merge(df1, df2, on='Product ID', how='outer')

   Product ID Product Name  Price
0           1            A  100.0
1           2            B  200.0
2           3            C  300.0
3           4            D    NaN
4           5            E  400.0

In [43]:
pd.merge(df1, df2, on='Product ID', how='left')

   Product ID Product Name  Price
0           1            A  100.0
1           2            B  200.0
2           3            C  300.0
3           4            D    NaN
4           5            E  400.0

In [45]:
pd.merge(df1, df2, on='Product ID', how='right')

   Product ID Product Name  Price
0           1            A    100
1           2            B    200
2           3            C    300
3           5            E    400